FulfillOrder/SOA/WSDLs/packAndShipOrder.wsdl

<?xml version= '1.0' encoding= 'UTF-8' ?>
<wsdl:definitions
     name="packAndShipOrder"
     targetNamespace="http://xmlns.oracle.com/e2e-1201-composites2/FulfillOrder/packAndShipOrder"
     xmlns:tns="http://xmlns.oracle.com/e2e-1201-composites2/FulfillOrder/packAndShipOrder"
     xmlns:inp1="http://www.oracle.com/soasample"
     xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
     xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    >
    <plnk:partnerLinkType name="packAndShipOrder">
        <plnk:role name="packAndShipOrderProvider" portType="tns:packAndShipOrder_ptt"/>
    </plnk:partnerLinkType>
    <wsdl:types>
        <xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://www.oracle.com/soasample" schemaLocation="../Schemas/CanonicalOrder.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="packAndShip_inputMessage">
        <wsdl:part name="request" element="inp1:Shipping"/>
    </wsdl:message>
    <wsdl:message name="packAndShip_outputMessage">
        <wsdl:part name="reply" element="inp1:Shipping"/>
    </wsdl:message>
    <wsdl:portType name="packAndShipOrder_ptt">
        <wsdl:operation name="packAndShip">
            <wsdl:input message="tns:packAndShip_inputMessage"/>
            <wsdl:output message="tns:packAndShip_outputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
</wsdl:definitions>
